bradlc.vscode-tailwindcss
databricks.neon-local-connect
docker.docker
dsznajder.es7-react-js-snippets
github.copilot
github.copilot-chat
golang.go
google.gemini-cli-vscode-ide-companion
google.geminicodeassist
humao.rest-client
josevseb.google-java-format-for-vs-code
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-modernize
ms-dotnettools.vscode-dotnet-runtime
ms-vscode-remote.remote-containers
ms-vscode.azure-repos
ms-vscode.remote-repositories
ms-vsliveshare.vsliveshare
openai.chatgpt
prisma.prisma
redhat.java
sonarsource.sonarlint-vscode
streetsidesoftware.code-spell-checker
svelte.svelte-vscode
tshino.kb-macro
usernamehw.errorlens
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.migrate-java-to-azure
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
wk-j.vscode-httpie
yoavbls.pretty-ts-errors
